In [1]:
import numpy as np
import pandas as pd

### Creating a Series

Series : 1차원 데이터 컨테이너. list와 유사. 각 pd.DataFrame의 column은 Series의 형태로 저장됨. 보통 dtype은 'object'임.

pd.DataFrame : Series의 Dictionary.

->numpy의 ndarray와 유사.

In [2]:
# pandas series
s1 = pd.Series(['banana', 42])
print(s1, '\n')
print('type=', type(s1), '\n')

s2 = pd.Series([42, 61])
print(s2, '\n')

0    banana
1        42
dtype: object

type= <class 'pandas.core.series.Series'>

0    42
1    61
dtype: int64

In [4]:
s2 = pd.Series(['banana', 42, 61])
print(s2, '\n')

0    banana
1        42
2        61
dtype: object

In [188]:
# manually assign index values to a series 
# by passing a Python list
s3 = pd.Series(['Wes McKinney','Creator of Pandas'], index = ['Person', 'Who'])
print(s3, '\n')

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

In [189]:
# Create a Series by passing a list of values, 
# Let pandas create a default integer index:
z11 = pd.Series([1.1, 2.2, 3.3, 4.4, 5.5]); 
print('PA1; \n', z11, '\n') 
print('PA1; \n', z11.index, '\n')
print('PA1; \n', z11.values, '\n') #numpy.ndarray

PA1;
 0    1.1
1    2.2
2    3.3
3    4.4
4    5.5
dtype: float64

PA1;
 RangeIndex(start=0, stop=5, step=1)

PA1;
 [1.1 2.2 3.3 4.4 5.5]

In [192]:
z12 = pd.Series([1.1, 2.2, 3.3, 4.4, 5.5], ['e', 'd', 'c', 'b', 'a']);

# print('PA21; \n', z12.head(), '\n')
# print('PA22; \n', z12.index, '\n')
# print('PA23; \n', z12['c'], '\n')
# print('PA24; \n', z12[z12 > 3], '\n')
print('PA25; \n', np.sin(z12), '\n')

PA25;
 e    0.891207
d    0.808496
c   -0.157746
b   -0.951602
a   -0.705540
dtype: float64

In [193]:
# Each key is separated from its value by a colon (:), 
# the items are separated by commas, and 
# the whole thing is enclosed  # in curly braces
# An empty dictionary without any items is written with 
# just two curly braces, like this: {}
zdata1 = {'Spring':111, 'Summer':222, 'Fall':333, 'Winter':444}; 
print('PA31; \n', zdata1, '\n')
print('PA32; \n', type(zdata1), '\n')

PA31;
 {'Spring': 111, 'Summer': 222, 'Fall': 333, 'Winter': 444}

PA32;
 <class 'dict'>

In [194]:
# Changing the order of the index
z13 = pd.Series(zdata1);
print('PA42; \n', z13, '\n')

season14 = ['Winter', 'Summer', 'Fall', 'Spring']; 
# print('PA41; \n', season14, '\n')

PA42;
 Spring    111
Summer    222
Fall      333
Winter    444
dtype: int64

In [17]:
z14 = pd.Series(zdata1, index=season14); 
print('PA43; \n', z14, '\n')

PA43;
 Winter    444
Summer    222
Fall      333
Spring    111
dtype: int64

In [118]:
# Name of index and series
z14.index.name = 'season'
z14.name = 'snow fall'
print('PA43; \n', z14, '\n')

PA43;
 season
Winter    444
Summer    222
Fall      333
Spring    111
Name: snow fall, dtype: int64

In [21]:
# Add index and check null
season15 = ['Winter', 'Summer', 'Autumn', 'Spring']; 
print('PA44; \n', season15, '\n')

z15 = pd.Series(zdata1, index=season15); 

print(z15.index)
print(z15.values)

print('PA45; \n', z15, '\n')
print('PA46; \n', pd.isnull(z15), '\n')
# print('PA47; \n', z15.isnull(), '\n')
print('PA48; \n', pd.notnull(z15), '\n')

PA44;
 ['Winter', 'Summer', 'Autumn', 'Spring']

Index(['Winter', 'Summer', 'Autumn', 'Spring'], dtype='object')
[444. 222.  nan 111.]
PA45;
 Winter    444.0
Summer    222.0
Autumn      NaN
Spring    111.0
dtype: float64

PA46;
 Winter    False
Summer    False
Autumn     True
Spring    False
dtype: bool

PA48;
 Winter     True
Summer     True
Autumn    False
Spring     True
dtype: bool

### Series Attributes

In [6]:
# scientists dataframe
scientists = pd.read_csv('data/scientists.csv')
scientists = pd.DataFrame(scientists, columns=['Occupation', 'Born', 'Died', 'Age', 'Name'])
scientists = scientists.set_index('Name')
scientists

                              Occupation        Born        Died  Age
Name
Rosaline Franklin                Chemist  1920-07-25  1958-04-16   37
William Gosset              Statistician  1876-06-13  1937-10-16   61
Florence Nightingale               Nurse  1820-05-12  1910-08-13   90
Marie Curie                      Chemist  1867-11-07  1934-07-04   66
Rachel Carson                  Biologist  1907-05-27  1964-04-14   56
John Snow                      Physician  1813-03-15  1858-06-16   45
Alan Turing           Computer Scientist  1912-06-23  1954-06-07   41
Johann Gauss               Mathematician  1777-04-30  1855-02-23   77

If we use the `.loc` method to subset the first row of our scientists dataframe, we will get a series object back

In [7]:
first_row = scientists.loc['William Gosset'] # location[row_index, column_index]
print(type(first_row), '\n')
print(first_row, '\n')

<class 'pandas.core.series.Series'>

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

* When a series is printed (i.e., the string representation), the index is printed down as the first ‘column’, and the values
are printed as the second ‘column’ 
* There are many attributes and methods associated with a series object
* Two examples of attributes are index and values

In [198]:
print('P01 \n', first_row.index, '\n')
print('P02 \n', first_row.values, '\n')

P01
 Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

P02
 ['Statistician' '1876-06-13' '1937-10-16' 61]

An example of a series method is keys, which is an alias for the index attribute.

In [199]:
# get the first index using an attribute
print('P03 \n', first_row.index[0], '\n')
# get the first index using a method 
print('P04 \n', first_row.keys()[0], '\n')
# keys
print('P05 \n', first_row.keys(), '\n')

P03
 Occupation

P04
 Occupation

P05
 Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

### The series is ndarray-like

* The Pandas.Series is very similar to the numpy.ndarray
* This means that many methods and functions that operate on an ndarray will also operate on a series
* People will also refer to a series as a ‘vector’

In [9]:
# get the ’Age’ column # Similar to numpy ndarray
ages = scientists['Age'] 
print('A01 \n', ages, '\n')
print('A02 \n', ages.mean(), '\n')
print('A03 \n', ages.min(), '\n')
print('A04 \n', ages.max(), '\n')
print('A05 \n', ages.std(), '\n')

A01
 Name
Rosaline Franklin       37
William Gosset          61
Florence Nightingale    90
Marie Curie             66
Rachel Carson           56
John Snow               45
Alan Turing             41
Johann Gauss            77
Name: Age, dtype: int64

A02
 59.125

A03
 37

A04
 90

A05
 18.325918413937288

In [10]:
print('B01 \n', ages, '\n')
print('B03 \n', ages.describe(), '\n')

B01
 Name
Rosaline Franklin       37
William Gosset          61
Florence Nightingale    90
Marie Curie             66
Rachel Carson           56
John Snow               45
Alan Turing             41
Johann Gauss            77
Name: Age, dtype: int64

B03
 count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [11]:
print('B04 \n', ages[ages > ages.mean()], '\n')
print('B05 \n', ages > ages.mean(), '\n')
print('B06 \n', type(ages > ages.mean()), '\n')

B04
 Name
William Gosset          61
Florence Nightingale    90
Marie Curie             66
Johann Gauss            77
Name: Age, dtype: int64

B05
 Name
Rosaline Franklin       False
William Gosset           True
Florence Nightingale     True
Marie Curie              True
Rachel Carson           False
John Snow               False
Alan Turing             False
Johann Gauss             True
Name: Age, dtype: bool

B06
 <class 'pandas.core.series.Series'>

In [202]:
# get index 0, 1, 4, and 5
manual_bool_values = [True, True, False, False, True, True,            
                                       False, False]
print('B07 \n', ages[manual_bool_values], '\n')

B07
 Name
Rosaline Franklin    37
William Gosset       61
Rachel Carson        56
John Snow            45
Name: Age, dtype: int64

### Operations Are Vectorized

* Many of the methods that work on series (and also dataframes) are vectorized
* It means that they work on the entire vector simultaneously
* It makes the code easier to read, and typically there are optimizations to make calculations faster

In [203]:
# Vectors of same length
# change the index of age by number from 0 to 7
ages = pd.Series(ages.values, index=range(len(ages)))
ages.name = 'Age'
print(ages, '\n')
print('C01 \n', ages+ages, '\n')

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

C01
 0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

* When you are working with vectors of different lengths, the behavior will depend on the type of the vectors
* With a Series, the vectors will preform an operation matched by the index
* The rest of the resulting vector will be filled with a ‘missing’ value, this is denoted with an NaN, for ‘not a number’
* This type of behavior is called ‘broadcasting’ and it differs between languages. 
* Broadcasting in Pandas refers to how operations are calculated between arrays with different shapes

In [12]:
ages1 = pd.Series(ages.values, index=range(len(ages)))
ages2 = pd.Series(ages.values, index=['0', '1', '2', '3', '4', '5', '6', '7'])
ages3 = ages1+ages2
# ages1.name = 'Age'
# print(ages1, '\n')
print('C02 \n', ages3, '\n')
print('C02 \n', ages3.index, '\n')

C02
 0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
6   NaN
7   NaN
dtype: float64

C02
 Index([0, 1, 2, 3, 4, 5, 6, 7, '0', '1', '2', '3', '4', '5', '6', '7'], dtype='object')

In [205]:
# Vectors with Scalars
print('C11 \n', ages+3.14, '\n')
print('C12 \n', ages*3.14, '\n')

C11
 0    40.14
1    64.14
2    93.14
3    69.14
4    59.14
5    48.14
6    44.14
7    80.14
Name: Age, dtype: float64

C12
 0    116.18
1    191.54
2    282.60
3    207.24
4    175.84
5    141.30
6    128.74
7    241.78
Name: Age, dtype: float64

In [206]:
print('C21 \n', pd.Series([1,100]), '\n')
print('C22 \n', ages, '\n')
print('C23 \n', ages + pd.Series([1,100]), '\n')

C21
 0      1
1    100
dtype: int64

C22
 0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

C23
 0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [207]:
# Vectors with Common Index Labels
# ages as they appear in the data
print('D01 \n', ages, '\n')
rev_ages = ages.sort_index(ascending=False)
print('D02 \n', rev_ages, '\n')

D01
 0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

D02
 7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [209]:
# reference output # to show index label alignment 
print('D03 \n', ages*2, '\n')
# note how we get the same values
print('D04 \n', ages + rev_ages, '\n')

D03
 0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

D04
 0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

### DataFrame

* The DataFrame is the most common Pandas object. 
* It can be thought of as Python’s way of storing spreadsheetlike data.
* Many of the common features with the Series carry over into the DataFrame.

In [13]:
scientists = pd.read_csv('data/scientists.csv')
print(type(scientists))
print(scientists)

<class 'pandas.core.frame.DataFrame'>
                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

### Creating a DataFrame

* A DataFrame can be thought of as a dictionary of Series objects
* This is why dictionaries are the most common way of creating a DataFrame
* The key will represent the column name, and the values will be the contents of the column

In [211]:
scientists = pd.DataFrame({
                ' Name': ['Rosaline Franklin', 'William Gosset'],
                ' Occupation': ['Chemist', 'Statistician'], 
                ' Born': ['1920-07-25', '1876-06-13'],
                ' Died': ['1958-04-16', '1937-10-16'], 
                ' Age': [37, 61]})
print(scientists, '\n')

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [212]:
scientists = pd.DataFrame(
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'],
          'Died': ['1958-04-16', '1937-10-16'], 
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'], 
    columns=['Occupation', 'Born', 'Died', 'Age'])
print(scientists, '\n')

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [213]:
# Datetime
z21 = pd.Series([1,3,5,np.nan,6,8]); 
print('\n z21 \n', z21, '\n')
dates = pd.date_range('20130101', periods=6);  
print('\n PD11 \n', dates, '\n')

 z21
 0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64


 PD11
 DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [214]:
# Matrix-like
df21 = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
print('\n PD12 \n', df21, '\n')

 PD12
                    A         B         C         D
2013-01-01  2.512013  0.619043 -1.349623  0.232023
2013-01-02  1.171309  0.403829  1.175753  0.402619
2013-01-03 -0.557745  1.013880 -0.880502  0.306881
2013-01-04  0.395355 -1.616468 -0.380885 -0.314516
2013-01-05 -0.108063  0.169742  0.388890  1.068679
2013-01-06  0.640821  0.857723 -0.134049 -0.840510

In [216]:
df22 = pd.DataFrame({ 'A' : 1.,
                      'B' : pd.Timestamp('20230102'),
                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                      'D' : np.array([3] * 4,dtype='int32'),
                      'E' : pd.Categorical(["test","train","test","train"]),
                      'F' : 'foo' }) 
print('\n PD21 \n', df22, '\n')

 PD21
      A          B    C  D      E    F
0  1.0 2023-01-02  1.0  3   test  foo
1  1.0 2023-01-02  1.0  3  train  foo
2  1.0 2023-01-02  1.0  3   test  foo
3  1.0 2023-01-02  1.0  3  train  foo

In [217]:
print('\n PD22 \n', df22.dtypes, '\n')
print('\n PD23 \n', df22.index, '\n')
print('\n PD24 \n', df22.columns, '\n')

 PD22
 A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object


 PD23
 Index([0, 1, 2, 3], dtype='int64')


 PD24
 Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [218]:
print('\n PD25 \n', df22.values, '\n')
print('\n PD26 \n', df22.describe(), '\n')
print('\n PD27 \n', df22.T, '\n')   # Transpose

 PD25
 [[1.0 Timestamp('2023-01-02 00:00:00') 1.0 3 'test' 'foo']
 [1.0 Timestamp('2023-01-02 00:00:00') 1.0 3 'train' 'foo']
 [1.0 Timestamp('2023-01-02 00:00:00') 1.0 3 'test' 'foo']
 [1.0 Timestamp('2023-01-02 00:00:00') 1.0 3 'train' 'foo']]


 PD26
          A                    B    C    D
count  4.0                    4  4.0  4.0
mean   1.0  2023-01-02 00:00:00  1.0  3.0
min    1.0  2023-01-02 00:00:00  1.0  3.0
25%    1.0  2023-01-02 00:00:00  1.0  3.0
50%    1.0  2023-01-02 00:00:00  1.0  3.0
75%    1.0  2023-01-02 00:00:00  1.0  3.0
max    1.0  2023-01-02 00:00:00  1.0  3.0
std    0.0                  NaN  0.0  0.0


 PD27
                      0                    1                    2  \
A                  1.0                  1.0                  1.0
B  2023-01-02 00:00:00  2023-01-02 00:00:00  2023-01-02 00:00:00
C                  1.0                  1.0                  1.0
D                    3                    3                    3
E                 test                train                 test
F                  foo                  foo                  foo

                     3
A                  1.0
B  2023-01-02 00:00:00
C                  1.0
D                    3
E                train
F                  foo

In [219]:
print('\n PD28 \n', df22.sort_index(axis=1, ascending=False), '\n') # sorting by an axis 
print('\n PD28-2 \n', df22.sort_index(axis=0, ascending=False), '\n') # sorting by an axis 
print('\n PD29 \n', df22.sort_values(by='E') , '\n')    # sorting by values

 PD28
      F      E  D    C          B    A
0  foo   test  3  1.0 2023-01-02  1.0
1  foo  train  3  1.0 2023-01-02  1.0
2  foo   test  3  1.0 2023-01-02  1.0
3  foo  train  3  1.0 2023-01-02  1.0


 PD28-2
      A          B    C  D      E    F
3  1.0 2023-01-02  1.0  3  train  foo
2  1.0 2023-01-02  1.0  3   test  foo
1  1.0 2023-01-02  1.0  3  train  foo
0  1.0 2023-01-02  1.0  3   test  foo


 PD29
      A          B    C  D      E    F
0  1.0 2023-01-02  1.0  3   test  foo
2  1.0 2023-01-02  1.0  3   test  foo
1  1.0 2023-01-02  1.0  3  train  foo
3  1.0 2023-01-02  1.0  3  train  foo

In [144]:
# Page 50
### Creating pandas dataframe from list and dictionary
### 1. List to dataframe
import pandas as pd

sales = [('Jones LLC', 150, 200, 50),
         ('Alpha Co', 200, 210, 90),
         ('Blue Inc', 140, 215, 95)]
labels = ['account', 'Jan', 'Feb', 'Mar']

# row oriented approach : from_records
df = pd.DataFrame.from_records(sales, columns=labels)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200   50
1   Alpha Co  200  210   90
2   Blue Inc  140  215   95

* 데이터프레임은 딕셔너리를 전달한다. 딕셔너리는 key와 value 로 이루어진 데이터쌍들의 순서를 보장하지는 않는다. 
* 그러나, 'OrderedDict'를 사용하면, 순서가 보장된 딕셔너리를 전달한다.

In [220]:
### 2. Dictionary to dataframe
from collections import OrderedDict
from datetime import date

# row oriented approach (list of dictionaries)
sales = [{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140},
         {'account': 'Alpha Co',  'Jan': 200, 'Feb': 210, 'Mar': 215},
         {'account': 'Blue Inc',  'Jan': 50,  'Feb': 90,  'Mar': 95 }]
df1 = pd.DataFrame(sales)
print('\n df1 \n', df1, '\n')

# column oriented approach
sales = {'account': ['Jones LLC', 'Alpha Co', 'Blue Inc'],
            'Jan': [150, 200, 50],
            'Feb': [200, 210, 90],
            'Mar': [140, 215, 95]}
df2 = pd.DataFrame.from_dict(sales)
print('\n df2 \n', df2, '\n')

 df1
      account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95


 df2
      account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

In [221]:
### 3. OrderedDict to dataframe

sales = OrderedDict([ ('account', ['Jones LLC', 'Alpha Co', 'Blue Inc']),
          ('Jan', [150, 200, 50]),
          ('Feb',  [200, 210, 90]),
          ('Mar', [140, 215, 95]) ] )
df = pd.DataFrame.from_dict(sales)
df

     account  Jan  Feb  Mar
0  Jones LLC  150  200  140
1   Alpha Co  200  210  215
2   Blue Inc   50   90   95

#### However, starting from Python 3.7, dictionaries are guaranteed to maintain the order of insertion!

In [222]:
# Subsetting methods for columns
scientists = pd.read_csv('data/scientists.csv')
scientists['Name']

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [223]:
scientists[['Name', 'Age']]

                   Name  Age
0     Rosaline Franklin   37
1        William Gosset   61
2  Florence Nightingale   90
3           Marie Curie   66
4         Rachel Carson   56
5             John Snow   45
6           Alan Turing   41
7          Johann Gauss   77

In [68]:
# Subsetting methods for rows
print(scientists.loc[5])
print(scientists.loc[[3,5]])

Name           John Snow
Born          1813-03-15
Died          1858-06-16
Age                   45
Occupation     Physician
Name: 5, dtype: object
          Name        Born        Died  Age Occupation
3  Marie Curie  1867-11-07  1934-07-04   66    Chemist
5    John Snow  1813-03-15  1858-06-16   45  Physician

In [69]:
print(scientists.iloc[5])
print(scientists.iloc[[5,6]])

Name           John Snow
Born          1813-03-15
Died          1858-06-16
Age                   45
Occupation     Physician
Name: 5, dtype: object
          Name        Born        Died  Age          Occupation
5    John Snow  1813-03-15  1858-06-16   45           Physician
6  Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [224]:
# Broadcasting
scient = scientists[['Name', 'Age']]
print(scient)

                   Name  Age
0     Rosaline Franklin   37
1        William Gosset   61
2  Florence Nightingale   90
3           Marie Curie   66
4         Rachel Carson   56
5             John Snow   45
6           Alan Turing   41
7          Johann Gauss   77

In [225]:
print(scient*2)

                                       Name  Age
0        Rosaline FranklinRosaline Franklin   74
1              William GossetWilliam Gosset  122
2  Florence NightingaleFlorence Nightingale  180
3                    Marie CurieMarie Curie  132
4                Rachel CarsonRachel Carson  112
5                        John SnowJohn Snow   90
6                    Alan TuringAlan Turing   82
7                  Johann GaussJohann Gauss  154

### Boolean Subsetting DataFrame

* `df[column name]` Single column
* `df[[ column1, column2, ... ]]` Multiple columns
* `df.loc [ row label ]` Row by row index label (row name)
* `df.loc [[ label1 , label2 , ...]]` Multiple rows by index label
* `df.iloc[row number]` Row by row number
* `df.iloc[[ row1, row2, ...]]` Multiple rows by index label or number
* `df[bool]` Row based on bool
* `df[[ bool1, bool2, ...]]` Multiple rows based on bool
* `df[ start :stop: step ]` Rows based on slicing notation

In [72]:
# Boolean vectors will subset rows
print('D04 \n', scientists[scientists['Age'] > 
         scientists['Age'].mean()], '\n')

D04
                    Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [73]:
scientists['Age'].mean()

59.125

In [74]:
scientists['Age'] > scientists['Age'].mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [75]:
print('E01 \n', scientists, '\n')
print('E03 \n', scientists.iloc[[True, True, False, False, True, 
                                               True, False, False]], '\n')

E01
                    Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

E03
                 Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
4      Rachel Carson  1907-05-27  1964-04-14   56     Biologist
5          John Snow  1813-03-15  1858-06-16   45     Physician

In [226]:
# Making a dataframe
z31 = pd.Series([1,3,5,np.nan,6,8])

dates = pd.date_range('20220201', periods=6)
df31 = pd.DataFrame(np.random.randn(6,4), index=dates,
           columns=list('ABCD'))
df31

                   A         B         C         D
2022-02-01 -1.276203 -0.142481  0.556643  1.549209
2022-02-02  0.279091  0.940020 -0.614352  2.346162
2022-02-03  0.303628  1.115184 -1.421332 -0.474432
2022-02-04 -0.369006  0.672061 -0.556284 -1.183119
2022-02-05  1.069905 -0.114597 -0.310769 -0.743456
2022-02-06 -1.858371  1.604028 -2.188863  1.064257

In [84]:
print('PA11 Apple \n', df31.head(2), '\n')
print('PA12 Apple \n', df31[0:2], '\n')

PA11 Apple
                    A         B         C         D
2022-02-01 -0.102168  0.315021  0.446248  0.183452
2022-02-02  0.753542 -0.502519 -0.704075  0.017554

PA12 Apple
                    A         B         C         D
2022-02-01 -0.102168  0.315021  0.446248  0.183452
2022-02-02  0.753542 -0.502519 -0.704075  0.017554

In [85]:
print('PA13 Apple \n', df31['A'], '\n')
print('PA14 Apple \n', df31['20220202':'20220204'], '\n')

PA13 Apple
 2022-02-01   -0.102168
2022-02-02    0.753542
2022-02-03    1.063801
2022-02-04    0.039864
2022-02-05   -0.659918
2022-02-06    0.999473
Freq: D, Name: A, dtype: float64

PA14 Apple
                    A         B         C         D
2022-02-02  0.753542 -0.502519 -0.704075  0.017554
2022-02-03  1.063801  0.300808  1.088541 -0.110296
2022-02-04  0.039864 -1.866120  1.508905  1.156505

In [86]:
# Selection by label
print('PA21 Apple \n', df31.loc[dates[0]], '\n')
print('PA22 Apple \n', df31.loc[:,['A','B']], '\n')
print('PA23 Apple \n', df31.loc['20220202',['A','B']], '\n')

PA21 Apple
 A   -0.102168
B    0.315021
C    0.446248
D    0.183452
Name: 2022-02-01 00:00:00, dtype: float64

PA22 Apple
                    A         B
2022-02-01 -0.102168  0.315021
2022-02-02  0.753542 -0.502519
2022-02-03  1.063801  0.300808
2022-02-04  0.039864 -1.866120
2022-02-05 -0.659918  2.727276
2022-02-06  0.999473  0.875198

PA23 Apple
 A    0.753542
B   -0.502519
Name: 2022-02-02 00:00:00, dtype: float64

In [87]:
print('PA24 Apple \n', df31.loc['20220202':'20220204',['A','B']],
           '\n')
print('PA25 Apple \n', df31.loc[dates[0],'A'], '\n')
print('PA26 Apple \n', df31.at[dates[0],'A'], '\n') # single value, faster

PA24 Apple
                    A         B
2022-02-02  0.753542 -0.502519
2022-02-03  1.063801  0.300808
2022-02-04  0.039864 -1.866120

PA25 Apple
 -0.10216790702723064

PA26 Apple
 -0.10216790702723064

In [229]:
# Boolean Indexing
print('PA41 Apple \n', df31[df31.A > 0], '\n')
print('PA42 Apple \n', df31[df31 > 0], '\n')

PA41 Apple
                    A         B         C         D
2022-02-02  0.279091  0.940020 -0.614352  2.346162
2022-02-03  0.303628  1.115184 -1.421332 -0.474432
2022-02-05  1.069905 -0.114597 -0.310769 -0.743456

PA42 Apple
                    A         B         C         D
2022-02-01       NaN       NaN  0.556643  1.549209
2022-02-02  0.279091  0.940020       NaN  2.346162
2022-02-03  0.303628  1.115184       NaN       NaN
2022-02-04       NaN  0.672061       NaN       NaN
2022-02-05  1.069905       NaN       NaN       NaN
2022-02-06       NaN  1.604028       NaN  1.064257

In [230]:
df32 = df31.copy()
df32['E'] = ['one', 'one','two','three','four','three'];
print(df32, '\n')
print('PA43 Apple \n', df32[df32['E'].isin(['two','four'])], '\n')

                   A         B         C         D      E
2022-02-01 -1.276203 -0.142481  0.556643  1.549209    one
2022-02-02  0.279091  0.940020 -0.614352  2.346162    one
2022-02-03  0.303628  1.115184 -1.421332 -0.474432    two
2022-02-04 -0.369006  0.672061 -0.556284 -1.183119  three
2022-02-05  1.069905 -0.114597 -0.310769 -0.743456   four
2022-02-06 -1.858371  1.604028 -2.188863  1.064257  three

PA43 Apple
                    A         B         C         D     E
2022-02-03  0.303628  1.115184 -1.421332 -0.474432   two
2022-02-05  1.069905 -0.114597 -0.310769 -0.743456  four

### Make Changes to Series and DataFrame

In [231]:
scientists = pd.read_csv('data/scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [233]:
# object datatype = '문자열'
print('F01 \n', scientists['Born'].dtype, '\n')
print('F02 \n', scientists['Died'].dtype, '\n')

F01
 object

F02
 object

In [112]:
# format the ’Born’ column as a datetime
born_datetime = pd.to_datetime(scientists['Born'], 
                                    format='%Y-%m-%d')
print('F03 \n', born_datetime, '\n')
# format the ’Died’ column as a datetime
died_datetime = pd.to_datetime(scientists['Died'], 
                                    format='%Y-%m-%d')
print('F04 \n', died_datetime, '\n')

F03
 0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

F04
 0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [113]:
born_datetime.head(3)

0   1920-07-25
1   1876-06-13
2   1820-05-12
Name: Born, dtype: datetime64[ns]

In [114]:
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
print('F05 \n', scientists.head(), '\n')
print('F06 \n', scientists.shape, '\n')

F05
                    Name        Born        Died  Age    Occupation    born_dt  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist 1920-07-25
1        William Gosset  1876-06-13  1937-10-16   61  Statistician 1876-06-13
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse 1820-05-12
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist 1867-11-07
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist 1907-05-27

     died_dt
0 1958-04-16
1 1937-10-16
2 1910-08-13
3 1934-07-04
4 1964-04-14

F06
 (8, 7)

In [116]:
scientists['age_days_dt'] = scientists['died_dt'] - scientists['born_dt']
print('F05 \n', scientists, '\n')
print('F06 \n', scientists.shape, '\n')

F05
                    Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

     born_dt    died_dt age_days_dt
0 1920-07-25 1958-04-16  13779 days
1 1876-06-13 1937-10-16  22404 days
2 1820-05-12 1910-08-13  32964 days
3 1867-11-07 1934-07-04  24345 days
4 1907-05-27 1964-04-14  20777 days
5 1813-03-15 1858-06-16  16529 days
6 1912-06-23 1954-06-07  15324 days
7 1777-04-30 1855-02-23  28422 days

F06
 (8, 8)

In [173]:
import random 
random.seed(42)
random.shuffle(scientists['Age'])
scientists

/Users/wooseong/miniforge3/lib/python3.9/random.py:362: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,77,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,90,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,37,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,61,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,41,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,66,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,56,Mathematician,1777-04-30,1855-02-23,28422 days

In [117]:
scientists['age_years_dt'] = scientists['age_days_dt'].astype('category')        
print('F09 \n', scientists, '\n')
print('F10 \n', scientists.shape, '\n')

F09
                    Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

     born_dt    died_dt age_days_dt age_years_dt
0 1920-07-25 1958-04-16  13779 days   13779 days
1 1876-06-13 1937-10-16  22404 days   22404 days
2 1820-05-12 1910-08-13  32964 days   32964 days
3 1867-11-07 1934-07-04  24345 days   24345 days
4 1907-05-27 1964-04-14  20777 days   20777 days
5 1813-03-15 1858-06-16  16529 days   16529 days
6 1912-06-23 1954-06-07  15324 days   15324 days
7 1777-04-30 1855-02-23  28422 days   28422 days

F10
 (8, 9)

In [177]:
# sample(frac=1) randomly shuffles all rows
# drop_index=True resets the index to start from 0
# scientists.sample(frac=1)
# scientists.sample(frac=0.5)
scientists.sample(frac=1).reset_index(drop=True)

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
2           Marie Curie  1867-11-07  1934-07-04   66             Chemist
3          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
4             John Snow  1813-03-15  1858-06-16   45           Physician
5         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
6        William Gosset  1876-06-13  1937-10-16   61        Statistician
7           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist

In [120]:
# Drop columns
print(scientists.columns)
scientists_dropped = scientists.drop(['Born', 'Died'], axis=1)
scientists_dropped

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt', 'age_years_dt'],
      dtype='object')

,Name,Age,Occupation,born_dt,died_dt,age_days_dt,age_years_dt
0,Rosaline Franklin,37,Chemist,1920-07-25,1958-04-16,13779 days,13779 days
1,William Gosset,61,Statistician,1876-06-13,1937-10-16,22404 days,22404 days
2,Florence Nightingale,90,Nurse,1820-05-12,1910-08-13,32964 days,32964 days
3,Marie Curie,66,Chemist,1867-11-07,1934-07-04,24345 days,24345 days
4,Rachel Carson,56,Biologist,1907-05-27,1964-04-14,20777 days,20777 days
5,John Snow,45,Physician,1813-03-15,1858-06-16,16529 days,16529 days
6,Alan Turing,41,Computer Scientist,1912-06-23,1954-06-07,15324 days,15324 days
7,Johann Gauss,77,Mathematician,1777-04-30,1855-02-23,28422 days,28422 days

# Data Loading and Subsetting

### Subsetting Columns

In [235]:
# Load Gapminder.tsv
df = pd.read_csv('data/gapminder.tsv', sep='\t')
print('print 3 rows \n', df.head(3), '\n')
print('type = ', type(df), '\n')
print('shape = ', df.shape, '\n')
print('columns ] ', df.columns, '\n')
print('dtypes, \n', df.dtypes, '\n')
print('information, \n', df.info, '\n')

print 3 rows
        country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710

type =  <class 'pandas.core.frame.DataFrame'>

shape =  (1704, 6)

columns ]  Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

dtypes,
 country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

information,
 <bound method DataFrame.info of           country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]>

In [122]:
# Subset columns by name
country_df = df['country'] 
print('type =', type(country_df), '\n') 
print('the first 5 rows', '\n', country_df.head(), '\n') 
print('the last 3 rows', '\n', country_df.tail(3), '\n')

type = <class 'pandas.core.series.Series'>

the first 5 rows
 0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

the last 3 rows
 1701    Zimbabwe
1702    Zimbabwe
1703    Zimbabwe
Name: country, dtype: object

In [124]:
# Subset Columns by Name

subsett = df[['country', 'continent', 'year']]
print('type =', subsett, '\n')
print('the first 5 rows = \n', subsett.head(), '\n')
print('the last 3 rows = \n', subsett.tail(3), '\n')

country_df_dot = df.country
print('the first 2 rows = \n', country_df_dot.head(2) , '\n')

type =           country continent  year
0     Afghanistan      Asia  1952
1     Afghanistan      Asia  1957
2     Afghanistan      Asia  1962
3     Afghanistan      Asia  1967
4     Afghanistan      Asia  1972
...           ...       ...   ...
1699     Zimbabwe    Africa  1987
1700     Zimbabwe    Africa  1992
1701     Zimbabwe    Africa  1997
1702     Zimbabwe    Africa  2002
1703     Zimbabwe    Africa  2007

[1704 rows x 3 columns]

the first 5 rows =
        country continent  year
0  Afghanistan      Asia  1952
1  Afghanistan      Asia  1957
2  Afghanistan      Asia  1962
3  Afghanistan      Asia  1967
4  Afghanistan      Asia  1972

the last 3 rows =
        country continent  year
1701  Zimbabwe    Africa  1997
1702  Zimbabwe    Africa  2002
1703  Zimbabwe    Africa  2007

the first 2 rows =
 0    Afghanistan
1    Afghanistan
Name: country, dtype: object

In [ ]:
# Subset columns by index position
subset = df[df.columns[1]]
print('index position 01 \n', subset.head(), '\n')
subset11 = df[df.columns[[0,-1]]]
print('index position 02 \n', subset11.head(), '\n')
subset12 = df[df.columns[0:3]]
print('index position 03 \n', subset12.head(), '\n')

In [127]:
# Subset Columns by Range

# create a range from 0 - 4 inclusive
small_range = list(range(5)) 
print('range 01 \n', small_range, '\n') 
subset21 = df[df.columns[small_range]] 
print('range 02 \n', subset21.head(5), '\n')

range 01
 [0, 1, 2, 3, 4]

range 02
        country continent  year  lifeExp       pop
0  Afghanistan      Asia  1952   28.801   8425333
1  Afghanistan      Asia  1957   30.332   9240934
2  Afghanistan      Asia  1962   31.997  10267083
3  Afghanistan      Asia  1967   34.020  11537966
4  Afghanistan      Asia  1972   36.088  13079460

In [126]:
# create a range from 3 - 5 inclusive
small_range = list(range(3, 6))
print('range 11 \n', small_range, '\n')
subset22 = df[df.columns[small_range]]
print('range 12 \n', subset22.head(3), '\n')

range 11
 [3, 4, 5]

range 12
    lifeExp       pop   gdpPercap
0   28.801   8425333  779.445314
1   30.332   9240934  820.853030
2   31.997  10267083  853.100710

## Subsetting rows

In [128]:
# Subset rows by 'loc' method
# get the first row 
print('.loc 01 => \n', df.loc[0], '\n') 

# get the 100th row 
# recall that values start with 0 
print('.loc 02 => \n', df.loc[99], '\n')

.loc 01 =>
 country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

.loc 02 =>
 country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

In [237]:
loc_series = pd.Series(['Hyunjun Choi','Woosung Cho', 'Byeungchan Kim'], index = [1, 3, 5])
print(loc_series, '\n')
# print(loc_series.loc[0], '\n')
print(loc_series.loc[1], '\n')

1      Hyunjun Choi
3       Woosung Cho
5    Byeungchan Kim
dtype: object

Hyunjun Choi

In [131]:
# get the last row (correctly)
# use the first value given from shape to get the total number

number_of_rows = df.shape[0]

# substract 1 from the value since we want the last index value
last_row_index = number_of_rows - 1

# finally do the subset using the index of the last row
print('.loc 03 => \n', df.loc[last_row_index], '\n')

# there are many ways of doing what you want
print('tail 03 => \n', df.tail(n=1), '\n')
subset_loc = df.loc[0]
print('.loc 04 => \n', type(subset_loc), '\n')
subset_head = df.head(n=1)
print('head 04 => \n', type(subset_head), '\n')

.loc 03 =>
 country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

tail 03 =>
        country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

.loc 04 =>
 <class 'pandas.core.series.Series'>

head 04 =>
 <class 'pandas.core.frame.DataFrame'>

In [140]:
# Subset Multiple Rows by '.loc' Method

# select the first, 100th, and 1000th row
# note the double square brackets similar to the syntax used to
# subset multiple columns
print('multiple rows => \n', df.loc[[0, 99, 999]], '\n')

multiple rows =>
          country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [143]:
# Subset Rows by Row Number w/ '.iloc' Method
# get the first row
print('iloc 01 => \n', df.iloc[0], '\n')

# get the 100th row
print('iloc 02 => \n', df.iloc[99], '\n')

# get the first, 100th, and 1000th rows
print('iloc 03 => \n', df.iloc[[0, 99, 999]], '\n')

iloc 01 =>
 country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

iloc 02 =>
 country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

iloc 03 =>
          country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [238]:
loc_series = pd.Series(['Hyunjun Choi','Woosung Cho', 'Byeungchan Kim'], index = [1, 3, 5])
print(loc_series, '\n')
print(loc_series.iloc[0], '\n')
# print(loc_series.iloc[1], '\n')

1      Hyunjun Choi
3       Woosung Cho
5    Byeungchan Kim
dtype: object

Hyunjun Choi

In [145]:
# get some rows and columns
print('iloc 11 => \n', df.iloc[0:2, 1:4], '\n')
print('iloc 12 => \n', df.iloc[:2, 1:4], '\n')
print('iloc 13 => \n', df.iloc[:2, ], '\n')
print('iloc 14 => \n', df.iloc[:, [1,3,5]], '\n')

iloc 11 =>
   continent  year  lifeExp
0      Asia  1952   28.801
1      Asia  1957   30.332

iloc 12 =>
   continent  year  lifeExp
0      Asia  1952   28.801
1      Asia  1957   30.332

iloc 13 =>
        country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314
1  Afghanistan      Asia  1957   30.332  9240934  820.853030

iloc 14 =>
      continent  lifeExp   gdpPercap
0         Asia   28.801  779.445314
1         Asia   30.332  820.853030
2         Asia   31.997  853.100710
3         Asia   34.020  836.197138
4         Asia   36.088  739.981106
...        ...      ...         ...
1699    Africa   62.351  706.157306
1700    Africa   60.377  693.420786
1701    Africa   46.809  792.449960
1702    Africa   39.989  672.038623
1703    Africa   43.487  469.709298

[1704 rows x 3 columns]

In [146]:
# Dataset Apple - Selection by Integer Position Locations
print('PA31 Apple \n', df31.iloc[3], '\n')
print('PA32 Apple \n', df31.iloc[3:5,0:2], '\n')
print('PA33 Apple \n', df31.iloc[[1,2,4],[0,2]], '\n')
print('PA34 Apple \n', df31.iloc[1:3,:], '\n')
print('PA35 Apple \n', df31.iloc[:,1:3], '\n')
print('PA36 Apple \n', df31.iloc[1,1], '\n')
print('PA37 Apple \n', df31.iat[1,1], '\n')

PA31 Apple
 A    0.039864
B   -1.866120
C    1.508905
D    1.156505
Name: 2022-02-04 00:00:00, dtype: float64

PA32 Apple
                    A         B
2022-02-04  0.039864 -1.866120
2022-02-05 -0.659918  2.727276

PA33 Apple
                    A         C
2022-02-02  0.753542 -0.704075
2022-02-03  1.063801  1.088541
2022-02-05 -0.659918 -1.195594

PA34 Apple
                    A         B         C         D
2022-02-02  0.753542 -0.502519 -0.704075  0.017554
2022-02-03  1.063801  0.300808  1.088541 -0.110296

PA35 Apple
                    B         C
2022-02-01  0.315021  0.446248
2022-02-02 -0.502519 -0.704075
2022-02-03  0.300808  1.088541
2022-02-04 -1.866120  1.508905
2022-02-05  2.727276 -1.195594
2022-02-06  0.875198  0.245372

PA36 Apple
 -0.5025191538357688

PA37 Apple
 -0.5025191538357688

In [239]:
# Dataset Apple - Subsetting
s31 = pd.Series([1,2,3,4,5,6],
        index = pd.date_range('20220202', periods=6))
print('PS1 Apple \n', s31, '\n')
dfT = df31; df31['F'] = s31;
print('PS2 Apple \n', df31, '\n')

PS1 Apple
 2022-02-02    1
2022-02-03    2
2022-02-04    3
2022-02-05    4
2022-02-06    5
2022-02-07    6
Freq: D, dtype: int64

PS2 Apple
                    A         B         C         D    F
2022-02-01 -1.276203 -0.142481  0.556643  1.549209  NaN
2022-02-02  0.279091  0.940020 -0.614352  2.346162  1.0
2022-02-03  0.303628  1.115184 -1.421332 -0.474432  2.0
2022-02-04 -0.369006  0.672061 -0.556284 -1.183119  3.0
2022-02-05  1.069905 -0.114597 -0.310769 -0.743456  4.0
2022-02-06 -1.858371  1.604028 -2.188863  1.064257  5.0

In [240]:
df31.at[dates[0],'A'] = 0
print('PS3 Apple \n', df31, '\n')
# iat = Similarly to iloc, iat provides integer based lookups
df31.iat[0,1] = 0
print('PS4 Apple \n', df31, '\n')

PS3 Apple
                    A         B         C         D    F
2022-02-01  0.000000 -0.142481  0.556643  1.549209  NaN
2022-02-02  0.279091  0.940020 -0.614352  2.346162  1.0
2022-02-03  0.303628  1.115184 -1.421332 -0.474432  2.0
2022-02-04 -0.369006  0.672061 -0.556284 -1.183119  3.0
2022-02-05  1.069905 -0.114597 -0.310769 -0.743456  4.0
2022-02-06 -1.858371  1.604028 -2.188863  1.064257  5.0

PS4 Apple
                    A         B         C         D    F
2022-02-01  0.000000  0.000000  0.556643  1.549209  NaN
2022-02-02  0.279091  0.940020 -0.614352  2.346162  1.0
2022-02-03  0.303628  1.115184 -1.421332 -0.474432  2.0
2022-02-04 -0.369006  0.672061 -0.556284 -1.183119  3.0
2022-02-05  1.069905 -0.114597 -0.310769 -0.743456  4.0
2022-02-06 -1.858371  1.604028 -2.188863  1.064257  5.0

In [241]:
df31.loc[:,'D'] = np.array([5]*len(df31));
print('PS5 Apple \n', df31, '\n')

df32 = df31.copy()
df32[df32 > 0] = -df32;
print('PS6 Apple \n', df32, '\n')

PS5 Apple
                    A         B         C    D    F
2022-02-01  0.000000  0.000000  0.556643  5.0  NaN
2022-02-02  0.279091  0.940020 -0.614352  5.0  1.0
2022-02-03  0.303628  1.115184 -1.421332  5.0  2.0
2022-02-04 -0.369006  0.672061 -0.556284  5.0  3.0
2022-02-05  1.069905 -0.114597 -0.310769  5.0  4.0
2022-02-06 -1.858371  1.604028 -2.188863  5.0  5.0

PS6 Apple
                    A         B         C    D    F
2022-02-01  0.000000  0.000000 -0.556643 -5.0  NaN
2022-02-02 -0.279091 -0.940020 -0.614352 -5.0 -1.0
2022-02-03 -0.303628 -1.115184 -1.421332 -5.0 -2.0
2022-02-04 -0.369006 -0.672061 -0.556284 -5.0 -3.0
2022-02-05 -1.069905 -0.114597 -0.310769 -5.0 -4.0
2022-02-06 -1.858371 -1.604028 -2.188863 -5.0 -5.0

In [242]:
df32 = df31.copy()
df32[df32 > 0]

                   A         B         C    D    F
2022-02-01       NaN       NaN  0.556643  5.0  NaN
2022-02-02  0.279091  0.940020       NaN  5.0  1.0
2022-02-03  0.303628  1.115184       NaN  5.0  2.0
2022-02-04       NaN  0.672061       NaN  5.0  3.0
2022-02-05  1.069905       NaN       NaN  5.0  4.0
2022-02-06       NaN  1.604028       NaN  5.0  5.0

### Groupby

In [243]:
df121 = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                             'foo', 'bar', 'foo', 'foo'],
                      'B' : ['one', 'one', 'two', 'three',
                             'two', 'two', 'one', 'three'],
                      'C' : ['ZZ', 'AA', 'CC', 'WW', 
                             'XX', 'HH', 'DD', 'UU'],      
                      'D' : np.random.randn(8),
                      'E' : np.random.randn(8),
                      'F' : [1, 2, 3, 'NA', 5, 6, 'NA', 8]});  
print('\n Groupby11 \n', df121, '\n')

 Groupby11
      A      B   C         D         E   F
0  foo    one  ZZ  0.804554  0.990109   1
1  bar    one  AA  0.225611 -0.126398   2
2  foo    two  CC -1.109957  0.084435   3
3  bar  three  WW  0.341182 -0.615449  NA
4  foo    two  XX -1.427399  0.673167   5
5  bar    two  HH -0.919157 -1.536640   6
6  foo    one  DD -0.245476  0.975653  NA
7  foo  three  UU  0.875044  0.174379   8

In [160]:
print('\n Groupby12 \n', df121.groupby('A').sum(), '\n')
print('\n Groupby13  \n', df121.groupby(['A','B']).sum(), '\n')

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [165]:
print('\n Groupby12 \n', df121.groupby('A')[['D', 'E']].sum(), '\n')
print('\n Groupby13  \n', df121.groupby(['A','B'])[['D','E']].sum(), '\n')

 Groupby12
             D         E
A
bar  1.004195 -1.878481
foo  1.298264 -0.352180


 Groupby13
                   D         E
A   B
bar one    0.437666 -0.647477
    three  2.140583  0.031729
    two   -1.574054 -1.262732
foo one    0.448604 -0.120274
    three  0.813213  0.345380
    two    0.036448 -0.577285

In [167]:
df121["G"] = df121["E"].astype(int); 

df121["H"] = df121["B"].astype("category"); 
print('\n Groupby 14 \n', df121, '\n')

 Groupby 14
      A      B   C         D         E   F  G      H
0  foo    one  ZZ -0.521054  0.557738   1  0    one
1  bar    one  AA  0.437666 -0.647477   2  0    one
2  foo    two  CC  0.453391 -0.366640   3  0    two
3  bar  three  WW  2.140583  0.031729  NA  0  three
4  foo    two  XX -0.416943 -0.210646   5  0    two
5  bar    two  HH -1.574054 -1.262732   6 -1    two
6  foo    one  DD  0.969658 -0.678012  NA  0    one
7  foo  three  UU  0.813213  0.345380   8  0  three

In [244]:
# Grouped means
df = pd.read_csv('data/gapminder.tsv', sep='\t')
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [169]:
# mean of life expectancy by year
print('Grouped means 01  \n', 
      df.groupby('year')['lifeExp'].mean(), '\n')
print('Grouped means 01  \n', 
      df.groupby('year').mean(), '\n')

Grouped means 01
 year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

TypeError: agg function failed [how->mean,dtype->object]

In [170]:
grouped_year_df = df.groupby(['year'])
print('Grouped means 01  \n', type(grouped_year_df), '\n')
print('Grouped means 02  \n', grouped_year_df, '\n')

Grouped means 01
 <class 'pandas.core.groupby.generic.DataFrameGroupBy'>

Grouped means 02
 <pandas.core.groupby.generic.DataFrameGroupBy object at 0x12b7ff020>

In [171]:
grouped_year_df_lifeExp = grouped_year_df['lifeExp'] 
print('Grouped means 03 \n', type(grouped_year_df_lifeExp))
print('Grouped means 04 \n', grouped_year_df_lifeExp)

Grouped means 03
 <class 'pandas.core.groupby.generic.SeriesGroupBy'>
Grouped means 04
 <pandas.core.groupby.generic.SeriesGroupBy object at 0x12c0dc440>

In [172]:
mean_lifeExp_by_year = grouped_year_df_lifeExp.mean()
print('Grouped means 05 \n', mean_lifeExp_by_year, '\n')

Grouped means 05
 year
1952    49.057620
1957    51.507401
1962    53.609249
1967    55.678290
1972    57.647386
1977    59.570157
1982    61.533197
1987    63.212613
1992    64.160338
1997    65.014676
2002    65.694923
2007    67.007423
Name: lifeExp, dtype: float64

In [173]:
# multiple columns
print('Grouped means 06 \n', 
      df.groupby(['year', 'continent'])[['lifeExp', 'gdpPercap']].mean())

Grouped means 06
                   lifeExp     gdpPercap
year continent
1952 Africa     39.135500   1252.572466
     Americas   53.279840   4079.062552
     Asia       46.314394   5195.484004
     Europe     64.408500   5661.057435
     Oceania    69.255000  10298.085650
1957 Africa     41.266346   1385.236062
     Americas   55.960280   4616.043733
     Asia       49.318544   5787.732940
     Europe     66.703067   6963.012816
     Oceania    70.295000  11598.522455
1962 Africa     43.319442   1598.078825
     Americas   58.398760   4901.541870
     Asia       51.563223   5729.369625
     Europe     68.539233   8365.486814
     Oceania    71.085000  12696.452430
1967 Africa     45.334538   2050.363801
     Americas   60.410920   5668.253496
     Asia       54.663640   5971.173374
     Europe     69.737600  10143.823757
     Oceania    71.310000  14495.021790
1972 Africa     47.450942   2339.615674
     Americas   62.394920   6491.334139
     Asia       57.319269   8187.468699
     Europe     70.775033  12479.575246
     Oceania    71.910000  16417.333380
1977 Africa     49.580423   2585.938508
     Americas   64.391560   7352.007126
     Asia       59.610556   7791.314020
     Europe     71.937767  14283.979110
     Oceania    72.855000  17283.957605
1982 Africa     51.592865   2481.592960
     Americas   66.228840   7506.737088
     Asia       62.617939   7434.135157
     Europe     72.806400  15617.896551
     Oceania    74.290000  18554.709840
1987 Africa     53.344788   2282.668991
     Americas   68.090720   7793.400261
     Asia       64.851182   7608.226508
     Europe     73.642167  17214.310727
     Oceania    75.320000  20448.040160
1992 Africa     53.629577   2281.810333
     Americas   69.568360   8044.934406
     Asia       66.537212   8639.690248
     Europe     74.440100  17061.568084
     Oceania    76.945000  20894.045885
1997 Africa     53.598269   2378.759555
     Americas   71.150480   8889.300863
     Asia       68.020515   9834.093295
     Europe     75.505167  19076.781802
     Oceania    78.190000  24024.175170
2002 Africa     53.325231   2599.385159
     Americas   72.422040   9287.677107
     Asia       69.233879  10174.090397
     Europe     76.700600  21711.732422
     Oceania    79.740000  26938.778040
2007 Africa     54.806038   3089.032605
     Americas   73.608120  11003.031625
     Asia       70.728485  12473.026870
     Europe     77.648600  25054.481636
     Oceania    80.719500  29810.188275

In [174]:
# Calculate frequencies
# use the nunique (number unique) to calculate 
print('Grouped means 07 \n', 
      df.groupby('continent')['country'].nunique(),'\n')

Grouped means 07
 continent
Africa      52
Americas    25
Asia        33
Europe      30
Oceania      2
Name: country, dtype: int64

In [175]:
# the number of unique values in a series
print('Grouped means 08 \n',
      df.groupby('continent')['country'].value_counts(),'\n')

Grouped means 08
 continent  country
Africa     Algeria           12
           Angola            12
           Benin             12
           Botswana          12
           Burkina Faso      12
                             ..
Europe     Switzerland       12
           Turkey            12
           United Kingdom    12
Oceania    Australia         12
           New Zealand       12
Name: count, Length: 142, dtype: int64

### Missing data

In [176]:
dates = pd.date_range('20220201', periods=6)
df41 = pd.DataFrame(np.random.randn(6,4), index=dates,
           columns=list('ABCD'))
print('MS1 Apple \n', df41, '\n')

MS1 Apple
                    A         B         C         D
2022-02-01 -0.325610 -0.112565 -2.229167  0.242462
2022-02-02 -0.789820 -0.897544  0.237840 -0.909135
2022-02-03  1.746809  0.811598  0.028812 -0.131707
2022-02-04  0.301938  0.255472 -0.287185  1.571416
2022-02-05 -0.352698  0.147315  1.805455 -0.179301
2022-02-06  1.012149  0.548468  0.066136 -0.730313

In [192]:
df41 = df41.reindex(index=dates[0:4], 
                                  columns =list(df31.columns)+['E']); 
print('MS2 Apple \n', df41, '\n')

MS2 Apple
                    A         B         C         D   E
2022-02-01 -0.667128 -0.548471  0.024112 -1.552206 NaN
2022-02-02  2.757254 -0.715237 -2.502123 -1.878850 NaN
2022-02-03 -1.361677 -0.680995  1.796769  2.040316 NaN
2022-02-04  0.696291  0.219688  2.079392  1.368923 NaN

In [177]:
df41.loc[dates[0]:dates[1],'E'] = 1;  
print('MS3 Apple \n', df41, '\n')
print(df41.dropna(how='any'), '\n')
print(df41.fillna(value=5), '\n')   # Filling missing data
print('MS4 Apple \n', pd.isnull(df41), '\n') # pandas; is null?

MS3 Apple
                    A         B         C         D    E
2022-02-01 -0.325610 -0.112565 -2.229167  0.242462  1.0
2022-02-02 -0.789820 -0.897544  0.237840 -0.909135  1.0
2022-02-03  1.746809  0.811598  0.028812 -0.131707  NaN
2022-02-04  0.301938  0.255472 -0.287185  1.571416  NaN
2022-02-05 -0.352698  0.147315  1.805455 -0.179301  NaN
2022-02-06  1.012149  0.548468  0.066136 -0.730313  NaN

                  A         B         C         D    E
2022-02-01 -0.32561 -0.112565 -2.229167  0.242462  1.0
2022-02-02 -0.78982 -0.897544  0.237840 -0.909135  1.0

                   A         B         C         D    E
2022-02-01 -0.325610 -0.112565 -2.229167  0.242462  1.0
2022-02-02 -0.789820 -0.897544  0.237840 -0.909135  1.0
2022-02-03  1.746809  0.811598  0.028812 -0.131707  5.0
2022-02-04  0.301938  0.255472 -0.287185  1.571416  5.0
2022-02-05 -0.352698  0.147315  1.805455 -0.179301  5.0
2022-02-06  1.012149  0.548468  0.066136 -0.730313  5.0

MS4 Apple
                 A      B      C      D      E
2022-02-01  False  False  False  False  False
2022-02-02  False  False  False  False  False
2022-02-03  False  False  False  False   True
2022-02-04  False  False  False  False   True
2022-02-05  False  False  False  False   True
2022-02-06  False  False  False  False   True

### Mixing it up

In [178]:
# Subset Rows and Columns
# get the 43rd country in our data
print('.loc 31 => \n', df.loc[42, 'country'], '\n')
print('.iloc 32 => \n', df.iloc[42, 0], '\n')

.loc 31 =>
 Angola

.iloc 32 =>
 Angola

In [180]:
no_rows = df.shape[0]
print(df.loc[no_rows-3:no_rows-1], '\n')
print(type(df.loc[no_rows-3:no_rows-1]), '\n')
print(type(df.loc[no_rows-1]), '\n')

       country continent  year  lifeExp       pop   gdpPercap
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

<class 'pandas.core.frame.DataFrame'>

<class 'pandas.core.series.Series'>

In [181]:
print(df.tail(n=3), '\n')
print(type(df.tail(n=3)), '\n')
print(type(df.tail(n=1)), '\n')

       country continent  year  lifeExp       pop   gdpPercap
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

<class 'pandas.core.frame.DataFrame'>

<class 'pandas.core.frame.DataFrame'>

In [183]:
# '.iloc' Method and '.loc' Method

# ‘iloc’ method subsets rows based on the index label
# ‘loc’ method subsets rows based on the row index number
print(len(df), '\n')
indexx = np.mod(np.arange(len(df)) + 3, len(df))
print(indexx, '\n')
df.index = indexx

1704

[3 4 5 ... 0 1 2]

In [184]:
df['year'].head()
df['year'].tail()

1702    1987
1703    1992
0       1997
1       2002
2       2007
Name: year, dtype: int64

### Statistics

In [194]:
dates = pd.date_range('20220201', periods=6)
df51 = pd.DataFrame(np.random.randn(6,4), index=dates,
           columns=list('ABCD')); df51

                   A         B         C         D
2022-02-01  0.381658 -0.564201 -1.550022 -0.165963
2022-02-02  0.486720 -1.524469  0.307471 -0.490075
2022-02-03  0.374161  1.010265  0.742260 -0.903433
2022-02-04  0.139778  1.799154 -1.240186  0.257931
2022-02-05  1.532762 -0.291590  2.349639 -0.328258
2022-02-06  0.975656 -0.726969 -0.335099  1.384967

In [195]:
print('SA12 Apple \n', df51.mean(), '\n')

# axis 1
print('SA13 Apple \n', df51.mean(1), '\n')

SA12 Apple
 A    0.648456
B   -0.049635
C    0.045677
D   -0.040805
dtype: float64

SA13 Apple
 2022-02-01   -0.474632
2022-02-02   -0.305088
2022-02-03    0.305813
2022-02-04    0.239169
2022-02-05    0.815638
2022-02-06    0.324639
Freq: D, dtype: float64

In [196]:
s51 = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
print('SA14 Apple \n', s51, '\n')
# DataFrame.sub = Subtraction of dataframe and other, 
# element-wise 
print('SA15 Apple \n', df51.sub(s51, axis='index'), '\n')

SA14 Apple
 2022-02-01    NaN
2022-02-02    NaN
2022-02-03    1.0
2022-02-04    3.0
2022-02-05    5.0
2022-02-06    NaN
Freq: D, dtype: float64

SA15 Apple
                    A         B         C         D
2022-02-01       NaN       NaN       NaN       NaN
2022-02-02       NaN       NaN       NaN       NaN
2022-02-03 -0.625839  0.010265 -0.257740 -1.903433
2022-02-04 -2.860222 -1.200846 -4.240186 -2.742069
2022-02-05 -3.467238 -5.291590 -2.650361 -5.328258
2022-02-06       NaN       NaN       NaN       NaN

In [197]:
print(df51)
print('SA21 Apple \n', df51.apply(np.cumsum), '\n')
print('SA22 Apple \n', df51.apply(lambda x: x.max() - x.min()), '\n')

                   A         B         C         D
2022-02-01  0.381658 -0.564201 -1.550022 -0.165963
2022-02-02  0.486720 -1.524469  0.307471 -0.490075
2022-02-03  0.374161  1.010265  0.742260 -0.903433
2022-02-04  0.139778  1.799154 -1.240186  0.257931
2022-02-05  1.532762 -0.291590  2.349639 -0.328258
2022-02-06  0.975656 -0.726969 -0.335099  1.384967
SA21 Apple
                    A         B         C         D
2022-02-01  0.381658 -0.564201 -1.550022 -0.165963
2022-02-02  0.868378 -2.088670 -1.242551 -0.656038
2022-02-03  1.242540 -1.078405 -0.500291 -1.559471
2022-02-04  1.382318  0.720749 -1.740477 -1.301540
2022-02-05  2.915080  0.429159  0.609162 -1.629798
2022-02-06  3.890735 -0.297810  0.274063 -0.244831

SA22 Apple
 A    1.392984
B    3.323623
C    3.899661
D    2.288400
dtype: float64

In [198]:
s511 = pd.Series(np.random.randint(0, 7, size=10))
print('SA23 Apple \n', s511, '\n')
print('SA24 Apple \n', s511.value_counts(), '\n')

SA23 Apple
 0    1
1    3
2    2
3    4
4    5
5    5
6    6
7    4
8    6
9    0
dtype: int64

SA24 Apple
 4    2
5    2
6    2
1    1
3    1
2    1
0    1
dtype: int64

### Categoricals

In [ ]:
df101 = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a', 'b', 'b', 'a', 'a', 'e']})
print('\n Category11 \n', df101, '\n')

In [ ]:
df101["grade"] = df101["raw_grade"].astype("category")
print('\n Category12 \n', df101, '\n')

In [ ]:
df101["grade"].cat.categories = ["very good", "good", "very bad"]
print('\n Category 13 \n', df101, '\n')

In [ ]:
# number of categories should be same
df101["grade"] = df101["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]) 
print('\n Category 14 \n', df101, '\n')

In [ ]:
df101.sort_values(by="grade") 
df101.groupby("grade").size()